[
  {
    "id": "mrs-queen-telangana",
    "title": "G Media Presents Mrs Queen Telangana Season 1",
    "description": "Hosted the prestigious beauty pageant celebrating beauty, confidence, and the power of womanhood.",
    "fullDescription": "As the host of Mrs Queen Telangana Season 1, I had the honor of facilitating this grand celebration of womanhood. The event featured esteemed judges including actress Indrajaa Absar, known for her iconic role in Yamaleela, and celebrated actress Raasi, famous for hits like Subhakankshalu & Gokulamlo Seeta. The pageant was a spectacular showcase of beauty, confidence, and empowerment, bringing together talented women from across Telangana. My role involved managing the flow of the event, conducting interviews, and maintaining the energy throughout this prestigious competition.",
    "date": "2024",
    "location": "Telangana",
    "images": ["/images/mrs-queen-telangana.jpg"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DGVx91IB4uH/?igsh=MWNwdjZlNjcxYTd6dQ=="
    }
  },
  {
    "id": "dhaniya-family-meet",
    "title": "Dhaniya Family Meet - Retro Bollywood Edition",
    "description": "Hosted the spectacular family meet with a vibrant Retro Bollywood theme at Ramoji Film City.",
    "fullDescription": "The Dhaniya Family Meet was a heartwarming celebration wrapped in a vibrant Retro Bollywood theme. Held at the iconic Ramoji Film City, the event featured timeless music, colorful retro vibes, and nonstop entertainment. The evening was made even more special with the presence of Jr. Amitabh Bachchan, who brought charisma and unmatched energy to the show. As the host, I facilitated this exclusive Hindi-speaking audience event, creating a true family celebration atmosphere where everyone came together to laugh, dance, and create lasting memories.",
    "date": "2024",
    "location": "Ramoji Film City, Hyderabad",
    "images": ["/images/dhaniya-family-meet.jpg"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DHvCJM3hBb1/?igsh=NTFqZTh3ZmdqdWN1"
    }
  },
  {
    "id": "ram-miriyala-event",
    "title": "Ram Miriyala Live Performance",
    "description": "Hosted an exclusive event featuring the Pride of Andhra Pradesh, Ram Miriyala, showcasing authentic Telugu music.",
    "fullDescription": "This special event featured Ram Miriyala, an authentic artist known for bringing the rich flavors of village life and farmer's struggles into his music. The event, presented by Vizag's Leading Sponsor Magazine - Red Magazine, was held at Vishwanadh Sports Club. As the host, I facilitated this celebration of Telugu music and culture, highlighting Ram Miriyala's journey from a small band to viral hits. The evening was a perfect blend of soulful lyrics, unique tonal quality, and heartfelt performances that truly represented the cultural essence of Andhra Pradesh.",
    "date": "2024",
    "location": "Vishwanadh Sports Club",
    "images": ["/images/new-year-neon-party.jpg"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DFmE-m4NEp7/?igsh=eXljbXhpb2F0bnBk"
    }
  },
  {
    "id": "new-year-neon-party",
    "title": "New Year Neon Party 2025",
    "description": "Hosted the spectacular New Year Neon Party at Waltair Club, welcoming 2025 with an electric crowd of 1600.",
    "fullDescription": "The New Year Neon Party at Waltair Club was a grand celebration that welcomed 2025 in style. As the host, I guided the energy of 1600 attendees through a night filled with sensational performances. The event featured the lively Street Jammers band, mesmerizing TRK Magic Show, and captivating Russian dancers. Interactive experiences included neon nail art, face art, and a fun photo booth. The night culminated with a spectacular fireworks display at midnight. This electrifying experience was curated by The Planning Co and presented by House of Reels, creating an unforgettable start to the new year.",
    "date": "December 2024",
    "location": "Waltair Club",
    "images": ["/images/ram-miriyala-event.jpg"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DE4ePtfyYBe/?igsh=enk5MzZ6MnU2ZWZh"
    }
  },
  {
    "id": "jam-junxion-musical-night",
    "title": "Jam Junxion's Biggest Musical Night @ Vizag",
    "description": "Hosted an epic musical extravaganza featuring 6 Telugu bands across 6 stages, drawing a massive crowd of over 8000 music enthusiasts.",
    "fullDescription": "What a sensational night it was at Jam Junxion's Biggest Musical Night in Vizag! The event was nothing short of a grand spectacle, featuring 6 epic Telugu bands performing across 6 electrifying stages, powered by 6 powerful consoles. The energy was truly off the charts with more than 8000 attendees filling the Vishwanath sports club. As the host, I had the privilege of orchestrating this massive celebration of music, where every second was pure magic. From pulsating beats to unforgettable performances, the audience brought the vibes alive and proved why Vizag is the true hub of music and passion.",
    "date": "2024",
    "location": "Vishwanath Sports Club, Visakhapatnam",
    "images": ["/images/jam-junxion-musical-night.png"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DC_PvzgzUUH/?igsh=djVjZG53cjVoZTNv"
    }
  },
  {
    "id": "cinematica-2-expo",
    "title": "Cinematica 2 Expo Day 1",
    "description": "Hosted the grand cinematic extravaganza featuring legendary filmmakers Ram Gopal Varma and Sandeep Reddy Vanga, drawing over 28,000 cinema enthusiasts.",
    "fullDescription": "What an incredible honor it was to host Cinematica 2 Expo, where cinema truly came alive! Introducing legends like Ram Gopal Varma sir, known for masterpieces like Shiva, Kshana Kshanam, Rangeela, Gaayam, and Govinda Govinda, alongside Sandeep Reddy Vanga sir on stage was a surreal experience—an absolute dream come true. The event was a celebration of storytelling, innovation, and the magic of filmmaking, bringing together a staggering 28,000 passionate individuals. From legendary filmmakers and top production studios to budding cinematographers and aspiring creators, all gathered under one roof. The energy, enthusiasm, and creativity at the expo were unmatched, making it more than just an event—it was a hub of inspiration for every cinema lover!",
    "date": "2024",
    "location": "Hyderabad",
    "images": ["/images/cinematica-2-expo.jpg"],
    "links": {
      "instagram": "https://www.instagram.com/reel/DD1FNvnzc3O/?igsh=MXg0MG9wY21rcHRiMg=="
    }
  },
  {
    "id": "celebrity-cricket-league",
    "title": "Celebrity Cricket League 2023",
    "description": "Master of ceremonies for the Celebrity Cricket League matches in Visakhapatnam, entertaining fans and introducing star players.",
    "fullDescription": "The Celebrity Cricket League 2023 in Visakhapatnam was an exciting fusion of cricket and entertainment, featuring film celebrities from various Indian film industries. As the event host, I maintained high energy throughout the matches, conducted live interviews with celebrity players, and engaged with the enthusiastic audience. The tournament attracted massive crowds, and my role involved creating an electric atmosphere that enhanced the sporting experience while highlighting the star power on the field.",
    "date": "February 2023",
    "location": "ACA-VDCA Cricket Stadium, Visakhapatnam",
    "images": ["/images/5be395c3-e0e7-4456-b793-785be5a626bd.png"],
    "videos": ["https://www.youtube.com/embed/dQw4w9WgXcQ"],
    "links": {
      "youtube": "#",
      "instagram": "#"
    }
  },
  {
    "id": "dr-reddys-family-day",
    "title": "Dr. Reddy's Laboratories Family Day",
    "description": "Hosted the annual family day celebration for Dr. Reddy's Laboratories, creating a fun and inclusive environment for employees and their families.",
    "fullDescription": "Dr. Reddy's Laboratories' annual Family Day was a joyous occasion that brought together employees and their loved ones for a day of celebration, games, and entertainment. As the master of ceremonies, I coordinated various activities including team competitions, children's performances, and talent shows. The day fostered camaraderie and strengthened the company culture, with my hosting adding warmth and excitement to this corporate celebration.",
    "date": "April 2023",
    "location": "Dr. Reddy's Campus, Hyderabad",
    "images": ["/images/8019dc85-19d4-412d-8e73-56e9fc2b98fd.png"],
    "testimonials": [
      {
        "name": "Shruti Agarwal",
        "role": "HR Head, Dr. Reddy's Laboratories",
        "comment": "Anusha's energy and people skills made our Family Day truly memorable. She connected effortlessly with both adults and children, making everyone feel included in the celebration."
      }
    ]
  },
  {
    "id": "pm-vishwakarma-scheme",
    "title": "PM Vishwakarma Scheme Launch - Warangal",
    "description": "Official host for the government launch event of the PM Vishwakarma Scheme in Warangal, facilitating a significant policy initiative.",
    "fullDescription": "The launch of the PM Vishwakarma Scheme in Warangal was a significant government initiative aimed at supporting traditional artisans and craftspeople. As the official event host, I managed the formal proceedings, which included addresses by government officials, explanations of the scheme's benefits, and testimonials from potential beneficiaries. The event required a careful balance of formality and accessibility to effectively communicate this important policy to diverse stakeholders including officials, media, and local community members.",
    "date": "September 2023",
    "location": "Warangal, Telangana",
    "images": ["/images/790ccc45-eba1-4546-9f24-e2575917807c.png"]
  },
  {
    "id": "telangana-fire-services",
    "title": "Telangana State Fire Services Headquarters Inaugural",
    "description": "Hosted the inaugural ceremony of the Telangana State Fire Services Headquarters, attended by the Chief Minister of Telangana.",
    "fullDescription": "The inaugural ceremony of the Telangana State Fire Services Headquarters was a prestigious event attended by the Chief Minister of Telangana, Shri A Revanth Reddy Garu. As the master of ceremonies, I coordinated the formal proceedings, which included the ribbon-cutting ceremony, facility tour, and addresses by government officials. The event highlighted the state's commitment to enhancing emergency response capabilities, with my role ensuring the proper protocol was followed for this significant governmental occasion.",
    "date": "February 2024",
    "location": "Hyderabad, Telangana",
    "images": ["/images/telangana-fire-1.jpg"]
  },
  {
    "id": "womens-cricketers-felicitation",
    "title": "CM Protocol Event - Women Cricketers Felicitation",
    "description": "Official host for the Chief Minister's special felicitation of two Women International Cricketers from Andhra Pradesh.",
    "fullDescription": "This prestigious protocol event saw the Chief Minister honoring two accomplished Women International Cricketers from Andhra Pradesh for their outstanding achievements. As the official host, I facilitated the formal ceremony, coordinating the felicitation process and managing the interactions between the government officials and the celebrated athletes. The event celebrated women's achievements in sports and emphasized the state's support for women athletes, with my role ensuring the proceedings maintained the appropriate decorum for this governmental recognition ceremony.",
    "date": "March 2023",
    "location": "Amaravati, Andhra Pradesh",
    "images": ["/images/cricketers-1.jpg"]
  },
  {
    "id": "global-investors-summit",
    "title": "Global Investors Summit 2023",
    "description": "Emceed the Global Investors Summit, facilitating discussions between government officials, business leaders, and international investors.",
    "fullDescription": "The Global Investors Summit 2023 was a major economic event aimed at attracting investments to the region. As the event host, I facilitated panel discussions, investor presentations, and networking sessions that brought together government representatives, industry leaders, and international investors. The summit focused on highlighting investment opportunities across various sectors, with my role involving managing complex sessions and ensuring clear communication between diverse stakeholders throughout this important economic forum.",
    "date": "March 2023",
    "location": "Visakhapatnam",
    "images": ["/images/global-investors-1.jpg"]
  },
  {
    "id": "global-tech-summit",
    "title": "Global Tech Summit Visakhapatnam 2023",
    "description": "Hosted the technology-focused conference bringing together industry leaders, innovators, and startups to discuss emerging trends and opportunities.",
    "fullDescription": "The Global Tech Summit in Visakhapatnam was a confluence of technological innovation and industry expertise. As the master of ceremonies, I facilitated keynote speeches, panel discussions, and startup showcases that highlighted emerging technologies and digital transformation strategies. The event attracted technology leaders, entrepreneurs, and innovators from across the country and beyond, with my role focused on maintaining the technical yet accessible tone appropriate for this specialized conference.",
    "date": "July 2023",
    "location": "Visakhapatnam",
    "images": ["/images/tech-summit-1.jpg"],
    "links": {
      "youtube": "#"
    }
  },
  {
    "id": "builders-convention",
    "title": "31st All India Builders Convention",
    "description": "Emceed the national convention of the Builders Association of India, focusing on sustainable construction practices.",
    "fullDescription": "The 31st All India Builders Convention brought together construction industry professionals from across the country to discuss sustainable building practices and industry challenges. As the event host, I managed a packed agenda that included technical presentations, panel discussions, and industry recognition awards. The convention addressed important topics like green building technologies and regulatory compliance, with my role involving synthesizing complex industry discussions and maintaining engagement throughout the multi-day professional event.",
    "date": "January 2024",
    "location": "Hyderabad",
    "images": ["/images/builders-1.jpg"]
  },
  {
    "id": "vizag-bay-marathon",
    "title": "Vizag Bay Marathon 2023",
    "description": "Official host for the annual Vizag Bay Marathon, encouraging participants and creating an energetic atmosphere throughout the event.",
    "fullDescription": "The Vizag Bay Marathon 2023 was a major sporting event that brought together professional runners, fitness enthusiasts, and community members. As the event host, I managed the pre-race motivation sessions, starting ceremonies, and award presentations, maintaining high energy throughout the day. The marathon promoted health and wellness while showcasing the beautiful coastal route of Visakhapatnam, with my role focused on encouraging participants and celebrating their achievements at various stages of this community sporting event.",
    "date": "December 2023",
    "location": "Visakhapatnam",
    "images": ["/images/marathon-1.jpg"]
  },
  {
    "id": "doctors-t20",
    "title": "Doctors T20 2023 - Visakhapatnam",
    "description": "Hosted the cricket tournament for medical professionals, combining sports entertainment with networking opportunities for the medical community.",
    "fullDescription": "The Doctors T20 2023 was a unique sporting event that brought together medical professionals from various specialties for a cricket tournament. As the master of ceremonies, I maintained the sporting atmosphere while facilitating networking opportunities between matches. The event combined competitive cricket with professional camaraderie, allowing doctors to showcase their sporting talents while building relationships across medical institutions. My hosting added entertainment value to this specialized community event that successfully balanced professional networking with recreational competition.",
    "date": "October 2023",
    "location": "Visakhapatnam",
    "images": ["/images/doctors-t20-1.jpg"]
  },
  {
    "id": "women-t20-andhra",
    "title": "Women T20 -2023 Andhra Pradesh",
    "description": "Official host for the Women's T20 cricket tournament, promoting women's sports and recognizing female cricket talent across Andhra Pradesh.",
    "fullDescription": "The Women's T20 Cricket Tournament 2023 showcased the growing talent in women's cricket across Andhra Pradesh. As the event host, I introduced the teams, provided commentary on key moments, and conducted post-match interviews with players and coaches. The tournament aimed to promote women's participation in sports and provide a platform for female cricketers to demonstrate their skills. My role involved highlighting player achievements and creating an engaging atmosphere that helped elevate the profile of women's cricket in the region.",
    "date": "July 2023",
    "location": "Andhra Pradesh",
    "images": ["/images/women-cricket-1.jpg"]
  },
  {
    "id": "handloom-charity-event",
    "title": "Handloom Protection Charity Event",
    "description": "Hosted the charity event organized by \"Spirit of Vizag\" Society to promote and preserve traditional handloom crafts.",
    "fullDescription": "This meaningful charity event focused on protecting and promoting traditional handloom crafts that represent an important cultural heritage. Organized by the \"Spirit of Vizag\" Society, the event included a handloom exhibition, artisan demonstrations, and a fundraiser to support local weavers. As the host, I conducted interviews with master craftspeople, facilitated panel discussions on sustainable fashion, and managed the charity auction. The event successfully raised awareness about the challenges facing the handloom sector while generating financial support for artisan communities.",
    "date": "August 2023",
    "location": "Visakhapatnam",
    "images": ["/images/handloom-1.jpg"]
  },
  {
    "id": "holi-celebration",
    "title": "\"Rang Barse\" Holi Celebration",
    "description": "Hosted the massive Holi festival celebration in Visakhapatnam, creating a vibrant and joyful atmosphere for thousands of participants.",
    "fullDescription": "\"Rang Barse\" was Visakhapatnam's largest Holi celebration, bringing together thousands of people for a day of music, dance, and festive colors. As the event host, I maintained high energy throughout the day, introducing musical performers, organizing group activities, and encouraging audience participation. The festival featured traditional Holi customs alongside modern entertainment, creating a culturally rich experience. My role involved managing the crowd's enthusiasm while ensuring the celebration remained safe and inclusive for all participants in this vibrant community festival.",
    "date": "March 2023",
    "location": "Visakhapatnam",
    "images": ["/images/holi-1.jpg"],
    "links": {
      "instagram": "#"
    }
  },
  {
    "id": "cruise-terminal-welcome",
    "title": "Vizag International Cruise Terminal Welcome",
    "description": "Hosted the grand welcoming ceremony for \"The World\" cruise ship at the Vizag International Cruise Terminal.",
    "fullDescription": "This grand gala event marked the arrival of the luxury cruise ship \"The World\" at the newly developed Vizag International Cruise Terminal. As the master of ceremonies, I coordinated the cultural welcome performances, facilitated interactions between port officials and cruise representatives, and managed the formal reception proceedings. The event showcased local culture and hospitality to international visitors while highlighting Visakhapatnam's growing importance as a cruise destination. My hosting helped create a memorable first impression for cruise passengers and emphasized the city's readiness to welcome global travelers.",
    "date": "November 2023",
    "location": "Visakhapatnam Port Authority",
    "images": ["/images/cruise-1.jpg"]
  },
  {
    "id": "winter-carnival",
    "title": "Winter Carnival at Ramoji Film City",
    "description": "Hosted the 47-day Winter Carnival at Ramoji Film City, entertaining large audiences with daily shows and special performances.",
    "fullDescription": "The Winter Carnival at Ramoji Film City was an extended 47-day celebration featuring daily entertainment, themed performances, and special attractions. As one of the primary hosts, I managed stage shows, audience interaction segments, and special event nights throughout the carnival period. The festival attracted large crowds seeking holiday entertainment, with varied programming designed to appeal to visitors of all ages. My role involved adapting to different audience compositions each day while maintaining the festive atmosphere essential to this commercial entertainment event.",
    "date": "December 2023",
    "location": "Ramoji Film City, Hyderabad",
    "images": ["/images/winter-carnival-1.jpg"],
    "links": {
      "instagram": "#"
    }
  }
]
